---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.IExternalApplication
source: html/d893b9a7-6f3e-bf1f-f4d6-5fbc269544bb.htm
---
# IExternalApplication Members

Implement this method to execute some tasks when Autodesk Revit shuts down.